[{"jobdescription":"Job Description  The Auto Club Group (ACG) provides membership, travel, insurance and financial services offerings to approximately 9 million members and customers across 11 states and 2 U.S. territories through the AAA, Meemic and Fremont brands. ACG belongs to the national AAA federation and is the second largest AAA club in North America.  Primary Duties and Responsibilities: Use .Net Framework, C#, HTML, JavaScript, Visual Basic, CSS and other web-based programming languages to develop code for consumer and internal websites. Collaborate with various departments and internet partners on creating and maintaining web applications and support the web content management system.  Work with project teams and staff from various departments to develop and implement website content and applications.? Develop web pages using a variety of software applications and development tools.? Provide technical site maintenance relative to search engine techniques, link integrity, navigation and other technical web developments.? Identifies and resolves bugs and defects.? Add content tags and updates tracking features in order to optimize marketing efforts to ensure the benefits of content/campaigns.? Create reporting and tracking tools for use by department personnel in analyzing the effectiveness of web content and applications.? Conduct user testing for all system changes to ensure the accuracy and integrity of data.  Maintain knowledge of cutting-edge web development practices and recommends them for use, as appropriate.  Preferred Qualifications: Bachelor Degree in Computer Science Information Systems, Business Administration or a related field 4+ years of experience with .Net development using C#, ASP.Net, MS SQL 2  3 years experience with Web Services particularly Web API. Previous experience with web applications development and managing professional web site, including server management, data modeling and integration. Solid front-end development skills and experience, including JavaScript, HTML5, CSS3, debugging, and troubleshooting is a plus. Experience working with web services and related technologies (JSON, REST, SOAP, XML). Native or Xamarin mobile application development in iOS and/or Android. Experience working with and programming in a Content Management Systems. Solid understanding of OOP and N-Tier architecture. Knowledge and experience with SDLC methodologies. GIT or other version control software Test Driven Development experience. Strong analytical skills and demonstrated experience. Experience working with clients gathering requirements and specifications.  Website application development experience in a multiple, diverse product environment.  Work Environment : Works in a temperature controlled office environment.? Frequent (up to 25% of time) travel required with exposure to road/air travel hazards and temperature extremes. Qualifications Required Qualifications: Education:  College coursework in Computer Science Information Systems, Business Administration or a related field.  Experience:  Developing and implementing innovative web applications Prioritizing, coordinating and meeting deadlines on multiple projects and activities Creating web project requirements for use by web page coding and layout Researching, testing and confirming accuracy of site content Evaluating web content for its value in search engine optimization according to keyword frequency, keyword density, formatting, etc. Documenting site content manager tools for department and external user groups Developing and maintaining a tracking schema for all web projects and assets Effectively manage, warehouse and catalog (using tracking schema) all website content assets Performing user acceptance testing of web content and web application as it pertains to supplied requirements Strong analytic skills as it pertains to analyzing and creating web reporting (google analytics, internal reporting, etc.)   Knowledge and Skills:  Knowledge of: Current and emerging web content practices and procedures Cascading style sheets (CSS) Mobile platforms and apps Content management systems and approval process flow Application of page layout and format principles   Technical skills: Development of web applications and web pages in Visual Studio, ASP.NET, .NET, VB.NET, HTML, XML, CSS, jQuery, CMS Tools, JavaScript, Visual Basics Cross platform web browsers (Internet Explorer, Safari, FireFox; Chrome) Windows/Mac, Mobile (Android, IOS) Operating Systems Google Analytics Content Management Systems  Ability to: Planning and organizing a high volume of projects Planning, prioritizing and decision making Provide analytical skill/and content knowledge to contribute to team Review and comprehend vendor manuals Communicate effectively with a wide variety of internal and external clients Work efficiently in a fast-paced, multiple and diverse product, team environment Research competitors' products and services Work irregular and/or extended hours to meet deadlines    The Auto Club Group offers a competitive compensation and benefits package including a base salary with performance based incentives; medical/dental/vision insurance, 401(k), generous time off, a complimentary AAA Membership and much more! The Auto Club Group, and all of?its affiliated companies,?is an equal opportunity/affirmative action employer. ?All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability or protected veteran status."},{"jobdescription":"We're looking for a developer experienced with Android and additional experience in one or more other mobile development environments, such iOS development with Swift/Objective-C, React Native, or even web development to join our team in Austin. Youll work with our clients to build great products that delight users while using weekly investment time to improve ourselves, our company, and our community. About thoughtbot thoughtbot works with companies in every  step of the process to help identify and solve problems. We lead and  participate in product design sprints, build high-quality apps, and then  deploy them. We use emerging and effective technologies and methods on  both internal and client projects. We believe there is always a better  way to do our work, and we want to find it and share it with as many  people as possible. Additionally, we maintain an inclusive work  environment where everyone can thrive professionally, as well as have  full lives outside of work. thoughtbot does not discriminate on the  basis of race, sex, color, religion, age, national origin, marital  status, disability, veteran status, genetic information, sexual  orientation, gender identity, or any other reason prohibited by law in  provision of employment opportunities and benefits. We welcome you to  apply and let us know if you need any reasonable accommodations during  the interview process. Want to dig deeper? Read more about our Purpose and Values, how we work in our Playbook, or check out this video to hear from our team. Requirements thoughtbot mobile developers are able to build high-quality, test-driven mobile applications. Well-qualified candidates have an excellent knowledge of Android development with Kotlin. While Android development experience is a must, additional experience in one or more other mobile development environments, such as iOS development with Swift/Objective-C, React Native, or even web development is required. All persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification upon hire. Benefits We like to keep ourselves happy while we work. Here at thoughtbot theres stellar vacation time and fully stocked offices with everything from string cheese to neat little notebooks. If you need a change of scenery, you can work from home. This is a full-time position with a competitive salary, paid time off, pension eligibility, and private health insurance. Our team works in a relaxed and educational environment to develop excellent products for our clients. We work a sustainable pace of 40 hours/week, consulting for clients four days/week. We also like to learn. Everything we do is predicated on having a great team and a culture of growing. We use the latest technologies and are always down to try new methods on both internal and client projects. INVESTMENT DAYS On Fridays, we have investment time when we learn new tools and techniques, work on open source, create new products, write blog posts, and try to make ourselves, each other, and the community better. ALWAYS LEARNING We pay 100% of expenses if you speak at conferences and 50% of the cost for attendees. We also have a 3-day hackathon at the end of every year. STAY FRESH We have five weeks of paid time off per year, personal days, plus extended leave. For new parents, we also have at least 6 weeks paid leave in all locations, as well as the ability to take at least 6 months off. HEALTHCARE + FINANCIAL For full-time U.S. employees, we pay 100% of medical, dental, vision, and life insurance premiums, plus we have a comprehensive 401k plan."},{"jobdescription":"Senior iOS Developer // Swift + React Native // Flatiron District Read Below and See If This Position Is A Fit! If so, Easy Apply now by clicking the \"Apply\" button and sending us your resume. If you are a fit, our Jobot Pro, Moses Nerpel, will get back to you with more details!    A bit about us:  We are a NYC Flatiron District healthcare software company that is changing the medical device industry with our platform. We are growing quickly and are looking for a Senior iOS Developer with 4+ years of mobile development experience to join our team as our mobile offerings continue to expand. If you are a Senior iOS Developer with great mobile development skills, expertise in Objective C or Swift, and apps in the App Stoir then please\n      read on….  What can we do for you?   Competitive Base\n      Salary! Extremely Competitive\n        Equity Package! Flexible Work\n      Schedules! Accelerated Career\n      Growth! Is your background a\n        fit? We are looking for…   4+ years’ experience developing rich iOS applications . Strong experience with  Objective C or Swift , familiar with  RESTful API. Solid  expertise  with  algorithms and design patterns . Experience in working with  cloud services (preferably AWS)  and client-server applications. Strong background in  Object-Oriented Design  and various design patterns. Strong experience with  multi-threaded programming and background processing . Experience in  writing different levels of tests. Good  communication  and collaborative skills. Excellent time and project management  skills. Passionate about revolutionizing healthcare and having a positive impact on people around the world. Experience with  well-architected apps published in the App store  is required. Bachelor’s degree  in  Computer Science  or equivalent experience. Why join\n  us?  We can offer you the\n      opportunity to work on State-of-the-Art technology and make a\n      meaningful and important impact on today’s society and the next\n      generation of mobile healthcare! Help us revolutionize the healthcare industry\n      and enjoy accelerated career growth with exciting equity stake with this industry leader! Interested? Interested in hearing more? Easy Apply now by clicking the \"Apply\" button."},{"jobdescription":"Based in Palo Alto, CA, we are the leading platform for investing and trading! Currently, we are looking for a Principal iOS Engineer to lead the charge with the development and strategy of our new and upcoming mobile offerings. If you would like to be an instrumental member in building our new mobile platform, and are attracted to invention and building things from the ground up, we would love the time to tell you more about this amazing opportunity. Top Reasons to Work with Us - Stable and renowned organization across the globe. - An environment which fosters a culture of innovation, curiosity, learning and challenging the status quo. - Revamping all of the mobile offerings - Tons of new development and new features to ship! What You Will Be Doing - Contribute in defining the mobile application strategy - Design and implement features for a suite of Mobile Applications - Learn and apply new technologies, best design practices and usability patterns - Contribute to end-to-end system architecture, working with back-end engineers - Collaborate with product managers and other technical teams to create optimized and delightful user experiences What You Need for this Position - 6+ years of professional mobile development experience - Expert knowledge of iOS & experience developing large scale mobile applications - 4-6+ years of experience using Swift and/or Objective-C (we prefer Swift) - Good grasp on usability and interaction design - Familiarity with RESTful APIs to connect mobile applications to back-end services - Strong knowledge of mobile UI design principles, patterns, and best practices - Experience with writing unit tests. -Nice to have/preferred skills: - Familiarity with cloud message APIs and push notifications - Proficient understanding of code versioning tools, such as Git - Familiarity with continuous delivery for mobile - Solid CS, OOP/OOD, design patterns What's In It for You - Salary ($165k - 185k) - Structured Cash Bonuses (15% - 18%) - Comprehensive Benefits (medical, dental, vision) - Pharmacy Benefits - HSA - Really strong ESPP - Potential sign-on bonus - 401K Matching - Commuter Benefits - PTO - Tuition assistance program - FSA - Lots of upward mobility and growth opportunities based on delivery So, if you are a talented Principal iOS Engineer looking for a ton of new development work and shipping new features, please apply NOW! Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer Your Right to Work"},{"jobdescription":"We Are Hiring Have you heard? Ascension Technologies, one of the largest healthcare information technology services in the country, is making a shift in their IT space!  Join the IT revolution with us as we turn our attention from technology that supports our national health system to developing, deploying, and driving technology that will change the face of healthcare.  If you enjoy creating something new, dreaming big, and have a passion for your expertise we encourage you to apply!  Ascension is a faith-based healthcare organization dedicated to transformation through innovation across the continuum of care. We believe you should be a tech founder not a fixer – that’s how we do tech at Ascension technologies. Why Join Ascension? Ascension Technologies? leverages technology to create collaborative solutions that improve everyday health decisions. The technology enables seamless access to data across all applications transforming the customer experience when interacting with technology and enhancing our ability across Ascension to better serve communities with greater agility and responsiveness.? It is used to provide insightful use of automation and data-drive improvements to enhance the provider, patient and consumer experience as well as keeping cybersecruity with a strong posture to protect data and other valuable assets. Ascension is a faith-based healthcare organization dedicated to transformation through innovation across the continuum of care. As one of the leading non-profit and Catholic health systems in the U.S., Ascension is committed to delivering compassionate, personalized care to all, especially to those most in need. In FY2018, Ascension provided nearly $2 billion in care of persons living in poverty and other community benefit programs. What You Will Do You will get to work in our River North location. River North is Chicago’s most renown area. It's home to the Magnificent Mile, one of the best-known shopping districts in the country, as well as one of the most iconic attractions in the city: Navy Pier. Ascension’s workspace is right in the heart of this area inside a historic landmark building with amenities to help feed your creativity. Enjoy lounges, private offices, and conference rooms with stunning views of the Chicago River—plus an onsite fitness center and a coffee bar with full-time barista. Commuting is a breeze with more than 10 bus lines all within a two-block radius. After work, walk out and enjoy some of the city’s best restaurants and entertainment options.  As a Mobile IOS Developer with Ascension Technologies, you will have the opportunity to contribute to development, testing & deployment of iOS Mobile Applications in healthcare, across a variety of devices, to deliver seamless experience for users exploration and collaboration, you will engage in a rewarding career that’s driven by you and powered by Ascension.  Our goal in this transformation is to hire people who are great at something. Give them new problems to work on. Trust them to be outstanding.  Key Responsibilities: Shape and implement technology and business solutions Use Agile engineering practices and various software development technologies to rapidly develop creative, high quality and efficient solutions that enhance Ascension’s technology stack Deliver product visualization based on input from Design Lead and Product Manager Collaborate with other team members to translate business requirements into user stories Write code and test scripts, and continuously deliver new / improved product functionality in an agile approach. Implement capabilities for automated test & upgrades Create appropriate documentation as defined by the agile approach Build Ascension’s brand in the technology community What You Will Need Knowledge: Deep knowledge of server-side technologies, frameworks such as Java, Go, SpringBoot Deep knowledge of Objective C or Swift, UIKit, iOS SDK and Core Data. Knowledge of consuming variety of RESTful APIs, SAML/OAuth/OIDC Knowledge of IOS testing frameworks such as XCTest Knowledge of server side API development is a plus. Education: Bachelor's degree in computer science, software engineering, or related technical field, or equivalent practical experience Work Experience: 3+ years of software development experience Experience publishing mobile app in an App Store. Experience in agile development process, pair programming, continuous integration and deployment Experience leveraging various design patterns, test-driven development, and automated testing frameworks Experience using Git and Jenkins Equal Employment Opportunity Ascension Technologies?is an EEO/AA Employer M/F/Disability/Vet. Please click the link below for more information.  http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf  EEO is the Law Poster Supplement http://www.dol.gov/ofccp/regs/compliance/posters/pdf/ofccp_eeo_supplement_final_jrf_qa_508c.pdf E-Verify Statement Ascension Technologies participates in the Electronic Employment Verification Program. Please click the E-Verify link below for more information. E -Verify (link to E-verify site)"},{"jobdescription":"Our client is currently seeking a iOS Developer Description: We are passionate about delivering world-class customer experiences utilizing cutting edge technologies through sound agile development practices. As we continue evolve our platform capabilities, the ideal person would have a strong passion for delivering innovative & sustainable solutions to our customers with a business-driven approach to architecture and a strong emphasis on quality, including DevOps concepts, build and test automation and should excel in a collaborative, results-driven culture and be able to influence engineers, stakeholders, and leadership on mobile strategies & technologies. Major Responsibilities: Works with other developers to build an architecturally sustainable codebase that delivers a high-quality experience for our associates and customers Consults with key technology stakeholders (internal and external API owners, etc.) to drive enhancements and changes to their products when needed by the mobile applications Drives analysis of metrics (NewRelic, etc.) data to constantly improve the user experience Works collaboratively with software engineering team as they implement & deliver mobile solutions through the entire software delivery life cycle. Is influential and engages actively in building out a dynamic and productive development organization and continuously improving practices and methodology through code reviews, etc. Displays strategic thinking and can come up with sustainable solutions that span across projects and platforms keeping an eye towards simplicity, reliability, manageability, scalability, extensibility, performance and re-use. Provides technical expertise in the areas of architecture, design, testing, and implementation. Identifies standards-based solutions that are appropriate to our environment and drives adoption via mentoring and guiding others who are still developing their skills. Initiates and leads effort towards organizational goals and objectives. Qualifications: A minimum of 7 years software development experience, 5 years of which are specific to front-end technologies, 3 years of which are in Mobile development using SWIFT and XCode. Expertise & experience in delivering mobile-first designs Experience with either iOS or Android platforms is a must. Knowledge of two platforms is preferable. Track record of building efficient, well-designed mobile applications at scale. Self-motivated team player who excels in a collaborative environment. Hands-on experience with Agile development practices & Agile, XP, or Scrum project methodologies. Strong sense of personal accountability; contributes beyond job role and responsibilities Excellent problem solving skills; meticulous & methodical, strong attention to detail. Ability to learn and apply new technologies quickly and self-directed Proven ability to translate complex business requirements into simple software solutions Passionate about continuously improving organizational practices Thorough understanding of Object Oriented principles (Analysis and Design) Full lifecycle development experience on large projects, creating distributed and scalable business systems. Top Technical Skills needed to perform this role: iOS(3-5 yrs) Swift / XCode experience with payments, encryption, OR mobile devices connecting to peripherals is a strong plus."},{"jobdescription":"Kforce has a client in search of a Mobile Developer - with focus on Android development in Dearborn, Michigan (MI) Embedded experience preferred Bachelor's degree required Android Native Developer Kforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Compensation Type: Hours Minimum Compensation: 0.00 Maximum Compensation: 0.00"},{"jobdescription":""},{"jobdescription":"LOCAL FTE CANDIDATES ONLY Ackmann & Dickenson (A&D) is looking for highly motivated, passionate, pragmatic mobile developer that will work closely with core team members and clients to implement state of the art mobile application solutions. The candidate will work on in-house and client projects. We are looking for mobile developers with Android skills. If you are interested in working in a collaborative, fun and flexible small company, this is the job for you! Responsibilities Develop Android apps for A&D clients and partners, including both maintaining existing apps and starting new projects Keep up-to-date on the latest Android SDK developments Research, design, and implement the appropriate technology solutions based on business needs Work with and assist project team members on projects Work collaboratively with UX and Design teams as a technical liaison and strategist Maintain consistent communication with A&D Project Managers regarding scheduling, progress and scope Qualifications Experience building modern Android apps using Java and Kotlin Experience with Android Studio and the Gradle build system Familiarity with common Android Frameworks Experience with Git and standard code review processes Excellent communication and collaboration skills Additional Skills Familiarity or experience with Swift and common iOS development practices Familiarity with hybrid framework solutions like Xamarin About Us Ackmann & Dickenson (A&D) is a strategic technology consulting and software development company with locations in Minneapolis & Phoenix. Our Minneapolis headquarters is nestled in the North Loop neighborhood, while the Phoenix office is located at Galvanize, a top-ranked co-working space located in the Warehouse District in Arizona. For an example of some of A&D?s most recent work, check out our case studies. A&D?s exceptional benefits package includes health, dental, vision, FSA, life, short and long-term disability insurance, and 401K with match. We also provide unlimited PTO/Sick Pay, flexible work hours and career development reimbursement. At A&D, we value each employee?s expertise and input. We offer respect, company Apple laptops, an open warehouse work atmosphere, flexible work hours ? and more. If you are interested in this position or would like to know more, please send your questions to jobs@ackmanndickenson.com."},{"jobdescription":"The Lead Fluid Power Applications Engineer is a primary technical resource for the outside sales team and the Applications Engineers, responsible for design and engineering of integrated hydromechanical and electronic controls solutions to meet customer system requirements. Working with outside sales, applications engineers and customers, the Lead Fluid Power Applications Engineer will assist and guide in the development and refinement of system specifications, organizing design concepts, developing costing, and preparing proposals to support outside sales. MAJOR RESPONSIBILITIES: Listen to, understand, and convey customer requirements internally and to our factory partners Lead Applications Engineers on technical projects; Guide Sales Reps with technical discussions Assess customer requirements, analyze customer systems, hydraulic circuits, control systems, and designs, then make recommendations for new systems solutions, improvements and upgrades Develop concepts of integrated hydromechanical and electronics systems used on mobile and industrial machinery. Create hydraulic circuits & electronic controls solutions working with CPS project engineers and customer engineers. Field validation testing and machine startups. Prepare quotations including component selection, sizing, and costing. Assess technical risk and assign contingency accordingly to provide timely quotations Articulate technical and product positioning to both purchasing and technical customers. Assist outside sales with formal proposals and customer presentations. Maintain expert knowledge of CPS product lines and systems integration capabilities relevant to hydromechanical applications in our market Maintain accurate engineering and applications assistance records including opportunities, notes, email, quotes, projects, and engineering records (drawings, designs, specifications, etc) Provide real time technical support to outside sales and customer engineers EDUCATION/EXPERIENCE: BSME with fluid power specialization. OR Associate degree in Fluid Power Technology with Fluid Power Certification 5+ years of engineering experience in the fluid power market, 7+ years preferred Expert in Hydraulic Fluid Power Systems and Integrated Controls Preferably experience in Plus+1 ? SPECIAL SKILLS: Proficient with AutoCAD or Solidworks, or other 2D and 3D modeling software for hydraulic circuit design and machine design Expert MS office user including Word, Excel, PowerPoint Strong communications and interpersonal skills with technical and non-technical personnel. Travel as needed. The goal is to have CPS Applications Engineers taking on most travel to customers with guidance from the Lead Applications Engineer."},{"jobdescription":"Day to Day:  Be a member of a company looking to expand their product offerings. Participate in tons of new development. Bring ideas to the table with regards to general application architecture. Collaborate with other Developers. Advocate for development best practices. Work with external development resources as needed.  Required Skill Sets:  Full stack .NET skills (C#, ASP.NET) Strong HTML5 experience Experience taking web applications and making them mobile friendly (cross platform) Strong API background (REST / RESTful, SOAP, microservices) Firm understanding of software design patterns, Software Development Life Cycle(s) (including Agile and Waterfall), automated and manual testing, and continuous integration is desirable Ability to mentor team members as needed  Bonus Skill Sets:  Xamarin"},{"jobdescription":"SBS Creatix is recruiting a Sharepoint Developer on behalf of our St. Louis client. The Sharepoint Developer will be responsible for critical technology including public websites, SharePoint adoption, firm intranets and enterprise search. This is a long term contracted opportunity with great pay and benefits.   Opportunity Overview  Edward Jones is seeking an experienced and talented individual to join the Web Content Management team responsible for critical technology including public websites, SharePoint adoption, firm intranets, and enterprise search. The ideal candidate is highly motivated to innovate and partner with key stakeholders to advance an increasingly mobile and collaborative workforce. Practical experience with SharePoint migrations in a large, fast paced and highly available enterprise environment is required.    Position Requirements Operational experience implementing, migrating, and supporting SharePoint Online, preferably in a large intranet environment Demonstrated understanding of and experience with large scale web content migrations Demonstrated understanding of SharePoint Framework Fundamental understanding of SharePoint workflow processes Demonstrated understanding of front-end technologies such as JavaScript, jQuery, HTML5/CSS3 Demonstrated understanding of front-end frameworks such as React.js, Angular.js, etc. Bachelor's Degree in Computer Science, Computer Information Systems, Management Information Systems preferred or equivalent experience Five or more years of experience directly related to information systems Detailed understanding of project management methodologies, system development lifecycle, infrastructure best practices, risk management concepts and capacity planning Strong willingness to learn and apply new and emerging technologies  "},{"jobdescription":" .NET Software Development Engineer (Desktop)  Lake Shore Cryotronics is an international leader in developing innovative measurement and control solutions, primarily for scientific applications. Our equipment is often used to characterize physical properties of early stage electronic and magnetic materials.  Our Software Development Engineers are high-caliber, self-motivated professionals with a passion for designing, developing, and testing software in a fast-paced agile team environment. The ideal candidate will have a strong interest in using their skills to help advance the state of science that benefits mankind, as this is Lake Shore's mission.  Some Primary Duties Include:   Developing software primarily using C#/.NET in Visual Studio, and occasionally in other similar languages (VB.NET, Java, Python) in a Windows environment, targeting either d esktop (Windows Forms / WPF) or mobile (Xamarin / Xamarin.Forms)  Writing clean, readable, self-documenting code using proven software development principles such as SOLID  Writing unit tests sufficient to balance high quality with high efficiency  Participating in a Scrum development process with a cross-functional team, providing feedback into the process for continuous improvement  Performing sustaining engineering, manufacturing, and service support for existing product lines as required  Developing and maintaining Continuous Integration (CI) and Continuous Delivery (CD) pipelines using Azure DevOps, and other related technologies  Developing and performing software verification and validation Quality Assurance (QA) testing  Using GIT code repository system, following prescribed branching strategies  Actively growingyour design capability; takingownership of your career providing regular self-evaluations and development plans  Keeping up with the state of the art of software development by attending conferences, reading publications, and/or participating in relevant organizations   Qualified candidates will possess the following:   Bachelors degree in Computer Science Engineering, or similar, with 0 5 years of relevant experience  Experience with C#/.NET and Visual Studio  Experience with unit testing frameworks and related technologies  Experience with Xamarin / Xamarin.Forms technologies a plus  Experience with Scrum or similar agile methodologies a plus  Experience using GIT a plus  Experience with CI / CD and other DevOps concepts, particularly using Azure DevOps a plus   Lake Shore Cryotronics is located in Westerville, a northeast suburb of Columbus OH and offers a work-life balance with challenging assignments, a focus on health and wellness , social activities , and community outreach . We are privately held and celebrating our 50th year in business.  We offer our employees a competitive compensation and benefits package (Medical, Dental, Vision, Life, and more). We are a recognized ColumbusCEO Top Workplace and a drug and tobacco free company.  Learn more about Lake Shore Cryotronics by visiting our website at www.lakeshore.com and also visit our Facebook and LinkedIn sites.  Equal Opportunity Employer of Minorities/Females/Disabled/Veterans  PI113833267"},{"jobdescription":"MARENA COSMOS - JR. WEBSITE ENGINEERING AND APPLICATIONS SUPPORT Office Location: 12 west 23rd street New York, New York 10001 We are a leading digital agency and software development firm that offers a full range of ecommerce and marketing automation services. Additionally, we provide our clients with a one of a kind integrated marketing platform called IMPGO. Our integrated marketing platform is fully customizable or offered as a SaaS. Our integrated marketing platform - impgo.com - has become a very popular platform for enterprise marketing and sales teams globally. We are looking for a Jr. Website engineer and applications support person that can work on multiple projects supporting various technical requirements. Our primary technology platforms include; Magento, Wordpress and Amazon Web Services. Your Responsibilities include: Log any technical issues received internally or from clients Troubleshoot & technical support of all client websites issues that come up Create sitemaps, wireframes or flow charts required to demonstrate functionality of clients or internal business requirements Provide support to programming and engineering team Conduct testing, clean up and fix requirements for newly released and existing projects Develop training materials and provide user training Must have experience with: Magento Wordpress Amazon Web Services Website or software development PHP Linux Javascript Google Analytics Search engine marketing / Search optimization Requirements: 2 years of professional web development and or technical support / IT experience Detail-oriented with strong management skills and the ability to meet deadlines Can solve problems not create them Has a great passion for website and software development We offer: Exceptional, pleasant work environment Healthcare benefits and 401K Desired Qualifications/Experience: Can do attitude with ability to wear different hats in given situations Have built websites within a professional team environment Experience using Wordpress and Magento Uses Google Drive applications (Docs, Slides, Sheets, etc.) Required Qualifications: Bachelor's Degree, preferably in Technology At least 2 years of professional experience with Ecommerce and website development Strong communication skills and ability to interact with internal teams, business stakeholders and clients effectively Strong organizational skills Proactive learner, who is willing to learn about different industries and client needs Understanding of today’s web / mobile technologies is key Articulate, good written and verbal skills, is key"},{"jobdescription":"We re looking for an experienced Senior Android Engineer or Technical Lead to help lead the design and development of our multiple android platform-based apps. As an Android technical lead, you will work within our digital organization to design, develop, deliver, as well as maintain and enhance world-class, Android-based apps across multiple platforms (Phone, tablet, television, smartwatch/wearables, etc. ). You should be ready to get into the weeds of technical design and development, but also ready to lead and mentor the work of others on the team. You should take pride in writing clean efficient reusable code as well as working closely with the team to ensure these standards. Finally, you should have a passion and desire to learn and master new technologies and standards. Responsibilities Works closely with the Director of Devices Technology to develop native software solutions based on a given set of requirements. Team player attitude. You need to work well with others. Architects, designs, develops, tests and maintains Android applications across multiple platforms (Android phone, tablet, Amazon fire/stick, Android TV, Chromecast, etc.) Leading and mentoring other team members. Works with project managers and ensures that all project milestones are met Investigates and resolves issues with our applications. Works collaboratively with peers and teams such as Business Owners, Product and QA Works closely with external teams for ongoing development. Provides technical estimates for development efforts. Provides solutions to requirements presented by the Business Analysts. Evaluating and researching latest device technology, coding patterns, OS Frameworks and features, and recommending and implementing within the larger digital team. Experience BS/BA in Computer Science, Information Systems, Engineering or related field and at least 6-8 years experience or equivalent training. Minimum of 3 years experience developing native Android client applications, with working knowledge and demonstrated experience of Java, Android SDKs and Frameworks. Minimum of 2+ years experience as a Principal, Lead, or Senior Software Engineer. Solid demonstrated experience testing your applications, including writing unit tests, test automation, and working closely with quality assurance teams. Successful launch of consumer grade applications to Google Play. Experience with efficient client-side integration with Restful and SOAP-based services in high-performance ecosystem. Thorough understanding of memory management in Android environments. Solid demonstrated experience launching Android applications on multiple devices. Solid demonstrated experiencing optimizing native Android applications for non-functional performance (memory, power, etc.) Experience working in Agile/SCRUM or Kanban processes and project methodologies, including best practices for source code management, Git, modern branching concepts, etc. Experience with Continuous Integration tools and processes. Excellent analytical and problem-solving skills. Experience in media-based apps, wearables, health a plus. iOS development a plus."},{"jobdescription":"The Android Engineer position will require cross-functional coordination across several groups, with an emphasis on partnering with Product, Creative, Marketing and Sales. The successful candidate will combine strategic planning and decision making with deep technical expertise.  Responsibilities  Execute full software development life cycle (SDLC) Develop documentation and visuals to identify requirements and solutions Collaborate with cross-functional teams to define, design, and ship new features and improve existing functionality Write well-designed, testable code Produce specifications and determine operational feasibility Integrate internal and third-party software components and APIs into fully functional systems Develop software verification plans and quality assurance procedures Troubleshoot, debug and upgrade existing systems Deploy software and evaluate user feedback and implement updates Comply with project plans and industry standards   Qualification  B.S. or M.S. in computer science or related field 5+ years of experience in software engineering Proven Android development skills and at least one major commercial release Working knowledge of the Android and mobile ecosystems including general trends, architectures, and upcoming technologies Expert knowledge of platform fragmentation and its effect on software development Experience in Git or other version control systems Past participation in agile/lean engineering cultures Experience architecting, designing and executing complex software projects Strong interpersonal and presentation skills to communicate effectively     Preferred Qualifications  Experience with cross-platform development with technologies such as Unity, react mobile Experience working with prototype hardware and manufacturing Prior experience in games or entertainment industries"},{"jobdescription":"Company Overview Imagine being part of a nimble team where your ideas and input have the potential to impact millions of lives. IRL aims to solve technology addiction by bringing people together in real life. Our goal is to help our users engage more with friends in-person to boost their overall happiness, encourage curiosity, and make the task of organizing hang outs a breeze. Our team is focused on building an intuitive social calendar that will be a one stop shop for all your calendar, event, and planning needs while still incorporating other platforms and methods of communication. We're looking for self-motivated engineers who have a passion for building high-quality consumer-facing applications. Job Summary The Senior Android Engineer will work remotely with the team to add new features, fix bugs, and help design the roadmap of the product. Responsibilities  Unit-test      code for robustness, including edge cases, usability, and general      reliability  Stay      up-to-date with new testing tools and test strategies  Translate      high fidelity wireframes to produce stellar UI  Optimize      applications for maximum performance and scalability Requirements  Experience      with Java and the Android SDK  Experience      working with remote data via REST and JSON  Experience      with third-party libraries and APIs  Solid      understanding of the full mobile development life cycle  Working      knowledge of the general mobile landscape, architectures, trends, and      emerging technologies  Proficient      understanding of versioning tools, such as Git and GitHub Desirable Experience  BS degree in      Computer Science or the equivalent hands-on experience  Android      mobile app deployment and management  Experience      with PHP, LAMP, MySQL  Team player      with a track record in developing high-quality software in complex      technology environments  Excellent      verbal and written communication skills  Experience      with gathering and documenting technical requirements and specifications Ideal Candidates will also have  Experience      with cross-platform mobile development frameworks  Experience      with cloud-based systems such as AWS  Ability to      mentor other developers and provide technical direction on application      architecture  Familiarity      with Software and Interoperability Techniques and Standards  Experience      with responsive design techniques and tools (CSS3, Material UI, Vuetify)  Deep      familiarity with software engineering best practices  Experience      working in an Agile and SCRUM environment  Strong      problem-solving capabilities Benefits & Perks  Full coverage      health insurance  Dental  Paid Holiday  Remote work Additional Details  Open to      full-time or contract applicants  Open to      international applicants (benefits may vary) Get Together Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status."},{"jobdescription":"Job Description Come join one of our many growing Android Teams! Each has it's own unique opportunity to help grow our business and make a positive impact on our merchants and sellers! Teams that are hiring: Developer Platform - https://squareup. com/us/en/developers eCommerce - https://squareup. com/us/en/online-store Point of Sale - https://squareup.com/us/en/point-of-sale Application Platform Mobile - The work on this team will be more internal platform focused and the challenges are going to be different from the standard feature/product work. For example, our Point of Sale app contains more than a million lines of code and so mobile development at this scale is highly complex and a largely unsolved problem in the industry. Connected Device Experience - Merchants require a collection of devices to run a remarkable business. The Connected Devices Experience Team provides an easy-to-use, feature rich, and reliable platform that creates memorable experiences. Check out our Open Source Libraries - http://square.github.io/ Also, check out our blog post on our Engineering Levels. Qualifications You will... Enjoy working on mobile apps at all levels from networking up to user interfaces and whatever s in between. Build high availability and highly resilient systems which can accept and accurately report payments no matter the network or device conditions. Collaborate with iOS, Android, and Server engineers to ship features. Work with product managers and designers to iterate on and define product scope and design. Languages and technologies we use (and teach)... Java and Kotlin for development. Espresso for UI testing. Protocol buffers for network transport. Gradle + OkBuck for our build environment. Also leverage Flow, LeakCanary, Dagger, Mortar, and okhttp for day to day development. Additional Information At Square, our purpose is to empower within and outside of our walls. In order to build the best tools for the businesses and customers we support all over the world, we have to start at home with a workforce as diverse and empowered as our sellers. To this end, we take great care to evaluate all employees and job applicants equally, based on merit, competence, and qualifications. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We encourage candidates from all backgrounds to apply and always consider qualified applicants with arrest and conviction records, in accordance with the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible."},{"jobdescription":"What youll be doing: This team is pioneering Tandems entry into the world of mobile health applications! As a member of the Software Engineering team, you'll be responsible for designing and developing a first-generation mobile application that will allow our customers to view their pump data directly on their mobile phone. In addition to meaningful, hands-on, technical work, youll also hone your leadership skills. Youll lead projects and train and mentor junior team members all within a fun, casual environment that inspires collaboration and innovation. Mobile health applications are sweeping across the diabetes community and this is your opportunity to join the ground floor of Tandems mobile development strategy.  Who we are:  Here at Tandem, Diabetes is all we do and we are dedicated to making the lives of people with diabetes better and better, through relentless innovation. In Tandem means together, and we strive to embody that in every aspect of our business. We believe that working in tandem, not in isolation, is the best way to continually exceed expectations.   Weve have been named one of the fastest growing insulin pump companies in the U.S! Why? Designed, assembled and supported from our San Diego, CA headquarters, Tandem has created the simple-to-use t:slim X2 Insulin Pump, which is the smallest pump available, the only color touch-screen insulin pump capable of remote feature updates, and the first CGM-enabled pump approved to let users make treatment decisions without pricking their finger.   Read more about our company & culture here: https://www.tandemdiabetes.com/careers/life-at-tandem and see what our customers are saying here: #tsliminthewild   What you need for this position:  Bachelor's degree in Engineering or Computer Sciences or related field or equivalent combination of education and applicable job experience.  Experience in Kotlin required  Experience in with a VCS, preferably Git  8+years experience in the field of mobile application for medical devices, web application software or in a related area  Proficient with formal software test methodologies  Proficient knowledge developing on the iOS and Android mobile platforms  Basic knowledge of at least one embedded or cloud-based programming language, preferably C or C#  Basic knowledge of JavaScript for using with automated testing.  Proficient at using version control applications such as GIT and SVN.  Skilled at translating high level requirements into software design and implementation.    Whats in it for you?  Weve got you covered. We offer a robust benefits package to support your health and your family. From medical, dental, and vision, to flexible spending accounts for both health and dependent care  Tandems got you covered!  Stay well with us. Enjoy the outdoors during your workday by biking, running, or walking on one of our nearby trails. Or check out our offsite gym, which boasts luxurious amenities including specialty fitness classes and state-of-the-art equipment.  Invest in your career. Tandem offers all employees access to training and development programs and courses to help keep your career and skillset updated, not outdated.  Live your life. Relax with 20 days of paid time off and celebrate 10 paid holidays in your first year. Save for your future with a company-provided 401(k) plan. Look forward to saving money on tickets to the San Diego Zoo, movies, restaurants, and so much more with our exclusive employee discount program.  Celebrate in Tandem. Join in monthly employee get-togethers, tacos for Cinco de Mayo, corned beef for St. Patricks Day, costume-contest for Halloween, and the annual JDRF walk."},{"jobdescription":"Acquired by Accenture Digital in June 2017 and founded in 2010, Intrepid is an end-to-end mobile design and development studio with headquarters in Cambridge, MA and offices in NYC, Houston, and Chicago. With expertise in insightful product strategy, well-crafted design and development for iOS, Android, Web and Rails, we help companies, from startup to enterprise, boldly navigate their mobile future. Accenture Digital The digital revolution is changing everything, transforming how we work and play, and Accenture Digital is leading the way - driving these exciting changes across 40 industries in more than 120 countries. Designing and implementing cutting-edge digital solutions for leading businesses and governments around the world, you will be creating real wow moments for customers, connecting them with our clients through advanced analytics, interactive, social media and mobility.  Join us and become an integral part of our experienced digital team with the credibility, expertise and insight clients depend on, to better serve their connected customers and operate always-on enterprises. Accenture Interactive Accenture Digital is powered by three practices - Interactive, Mobility and Analytics. Accenture Interactive helps the worlds leading brands delight their customers and deliver superior business performance and customer experiences. As part of Accenture Interactive Platforms & Products, youll balance art and science to create award-winning digital experiences for todays connected consumers through integrated and dynamic solutions that incorporate strategy, marketing, creative and technology. Job Description Our Android Developers are engineers eager to stay on the bleeding-edge of the mobile market across a broad spectrum of industries. You are motivated by the idea of implementing mobile solutions and bringing clients mobile products to life. You enjoy exploring new technologies and have experience developing mobile projects on your own or in small teams. YOUR ROLE: Android Developer Work closely on a cross functional team including other developers, designers, Project Managers, QA, etc Leverage experience developing software to execute on mobile development projects of various sizes for clients across multiple industries Communicate frequently with clients including project plans and scope Participate in Agile/SCRUM SDLC Lead code and architecture reviews YOUR EXPERIENCE: Basic Qualifications 3+ years of experience in software development 2+ years of software development in a team environment Bachelors degree SET YOURSELF APART: Preferred Skills Knowledge of Android SDK and Android Studio Experience with Java is a plus Experience with client-side software development, especially user interfaces Proficient with Unit and integration tests Knowledge of web services, specifically REST APIs Knowledge of RxJava, MVP, Bluetooth Experience leading small teams of developers Natural leader who is frequently sought out for guidance and advice Previous experience interfacing with clients in consulting environment preferred Have worked in Agile environment (Scrum preferred) Hands on experience developing production-ready Android apps Accenture is a leading global professional servicescompany, providing a broad range of services and solutions in strategy,consulting, digital, technology and operations. Combining unmatched experienceand specialized skills across more than 40 industries and all businessfunctions  underpinned by the worlds largest delivery network  Accentureworks at the intersection of business and technology to help clients improvetheir performance and create sustainable value for their stakeholders. With469,000 people serving clients in more than 120 countries, Accenture drivesinnovation to improve the way the world works and lives. Visit us at www.accenture.com. Applicants for employment in the US must have workauthorization that does not now or in the future require sponsorship of a visafor employment authorization in the United States and with Accenture. Candidates who are currently employed by a client ofAccenture or an affiliated Accenture business may not be eligible forconsideration. Accenture is an EEO and Affirmative Action Employer ofFemales/Minorities/Veterans/Individuals with Disabilities. Equal Employment Opportunity All employment decisions shall be made without regardto age, race, creed, color, religion, sex, national origin, ancestry,disability status, veteran status, sexual orientation, gender identity orexpression, genetic information, marital status, citizenship status or anyother basis as protected by federal, state, or local law. Job candidates will not be obligated to disclosesealed or expunged records of conviction or arrest as part of the hiringprocess. Accenture is committed to providing veteran employmentopportunities to our service men and women."},{"jobdescription":"Job Description We are looking for a Senior Android Developer to help create the future of Mixed Reality computing. This role is perfect for a collaborative self-starter with an endless curiosity and deep desire to innovate. Our ideal candidate will have extensive experience developing high-performance Android applications with rich visual interfaces. Strong experience with Kotlin or Java is a must, and additional knowledge of Flutter or React would be a bonus. Additionally, experience with Augmented Reality, Mixed Reality, OpenCV, OpenGL, and iOS are beneficial. Responsibilities: Build, debug, and deploy world-class applications for Android Team player who can collaborate with cross-functional teams to define, design and ship new features Utilize native libraries to enable advanced application features Work on bug fixing and improving application performance Unit-test code for robustness and reliability Qualifications: 8+ years of Android Development experience (Java, Kotlin) Experience programming for Android using the Android SDK / Android Studio Deep understanding of modern Android development best practices Experience working with third-party libraries Solid understanding of the full mobile development life cycle Have published at least one Android app to the Google Play Store Strong communication skills and ability to work in a fast-paced small team environment Nice to have Experience with AR/MR using ARCore Experience with Bluetooth Low Energy (BLE) Experience with C++ Experience with OpenCV, OpenGL, and iOS Experience with React Native, Flutter Experience with rapid development and collaboration using wiki, chat, and Jira Education: BA/BS or equivalent preferred Additional Information All your information will be kept confidential according to Equal Employment Opportunities guidelines"},{"jobdescription":"Company We are PickTrace, a fast-growing software start-up that provides workforce and harvest management solutions for large-scale farms. We are building the farm management system of the future. Today, we serve some of the largest berry, citrus, and apple growers in the United States and internationally, and our application is used by tens of thousands of farmworkers each day. PickTrace is a YCombinator-backed company, and we just raised a Series A round of financing from an investment firm with a track record of building multi-billion dollar software companies. We are based in Glendale, CA, in the Los Angeles area, and we are hiring rapidly engineers to supercharge our growth. Our software offering is built on a multi-tenant microservices-based platform utilizing dockerized services and Kubernetes within Google Cloud Platform, featuring a ReactJS front-end and a back-end written primarily in Python and Golang. Our mobile application is Android-first, written in Kotlin, with agriculture-specific applications including asynchronous data communication, bluetooth, GPS, and in-field push notifications. Role As PickTraces Senior Android Engineer, you will be a key hire to own the mobile side of our technology. This engineer will drive all development efforts related to our mobile application, from architecture and design decisions, to collaboration with UI/UX design, to hands-on implementation. Were looking for someone capable of consistently producing high-quality work, who is outstanding in their follow-through, who is not content with partial solutions, and who is thoughtful in both planning and implementation. Most importantly, were looking for an individual who is friendly and easy to work with, passionate about their work, and receptive to feedback and professional growth. This role offers the potential to grow and lead an Android team in the future. Responsibilities Become an expert on the context and workplace needs of PickTrace customers in order to: craft an elegant, high-performance mobile user experience regardless of connectivity or device ensure that end users of the PickTrace Android app have an empowering, frictionless experience build product for users of varying levels of tech-savviness, trust in technology, and demographics Build new features on a standalone basis with minimal oversight, collaborating with other engineers on your team to produce clean and operationally sound software, as well as: Developing technical plans and contributing to our architecture as we grow Owning the technical bar for the Android app, from enforcing best practices to unit testing to CI and our release process Designing and implementing a world-class mobile development process to seamlessly launch new products and iterate on existing features, in collaboration with: back-end engineers front-end engineers product managers designers and other cross-functional colleagues Help build and maintain an excited, cohesive engineering organization, including: assist in the hiring of an A+ engineering and product team offer guidance and professional development to less tenured engineers nurture a culture of collaboration, drive, and passion Qualifications You have 3+ years of experience with the latest technologies for the Android platform: Android Studio Kotlin Gradle Android SDK You have knowledge of and a passion for current trends and best practices in mobile architecture. You have a deep understanding of mobile performance, latency, and security issues. Youve published applications in Google Play, and have experience with Android Market & associated distribution processes. You have strong UI/UX skills, with an emphasis on UX. You are an innovative, big picture thinker but ultra-proficient with technical details. You have a knack for simplifying, breaking down, and honing in on the core elements of problems to drive towards solutions. You have strong communication skills and can work effectively with a cross-functional team (including with non-technical colleagues). Benefits At PickTrace, we are a dynamic, warm, and collegial start-up environment. We offer benefits including: Competitive salary compensation Equity 401(k) Healthcare benefits Flexible time off Free parking Casual dress Build-your-own workstation If this sounds like your cup of tea, we would absolutely love to meet you!"},{"jobdescription":"We are looking for an Android engineer with a deep desire to learn and a passion for mobile development. The backbone of our panel business is our successful mobile applications which we have launched in multiple countries and continue to be the focus of innovation and the conduit for our relationship with our users and the data they provide us. We are looking for a skilled Android engineer to take on a critical role working with a highly skilled team to create the future of mobile for Numerator. Excellent understanding of Java/Kotlinand the Android SDK Experience developing, testing, andreleasing Android applications Passion for mobile projects and mobiledevelopment Fully comfortable with version controlsystems, preferably git Experience with multithreaded programming Exceptional Candidates Will Have Full stack development experience, especially in Python Experience in iOS or cross platform mobile development Experience with performance analysis and optimization We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. Excellent understanding of Java/Kotlinand the Android SDK Experience developing, testing, andreleasing Android applications Passion for mobile projects and mobiledevelopment Fully comfortable with version controlsystems, preferably git Experience with multithreaded programming Exceptional Candidates Will Have Full stack development experience, especially in Python Experience in iOS or cross platform mobile development Experience with performance analysis and optimization We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."},{"jobdescription":"Acquired by Accenture Digital in June 2017 and founded in 2010, Intrepid is an end-to-end mobile design and development studio with headquarters in Cambridge, MA and offices in NYC, Houston, and Chicago. With expertise in insightful product strategy, well-crafted design and development for iOS, Android, Web and Rails, we help companies, from startup to enterprise, boldly navigate their mobile future. Accenture Digital The digital revolution is changing everything, transforming how we work and play, and Accenture Digital is leading the way - driving these exciting changes across 40 industries in more than 120 countries. Designing and implementing cutting-edge digital solutions for leading businesses and governments around the world, you will be creating real wow moments for customers, connecting them with our clients through advanced analytics, interactive, social media and mobility. Join us and become an integral part of our experienced digital team with the credibility, expertise and insight clients depend on, to better serve their connected customers and operate always-on enterprises. Accenture Interactive Accenture Digital is powered by three practices - Interactive, Mobility and Analytics. Accenture Interactive helps the world s leading brands delight their customers and deliver superior business performance and customer experiences. As part of Accenture Interactive Platforms & Products, you ll balance art and science to create award-winning digital experiences for today s connected consumers through integrated and dynamic solutions that incorporate strategy, marketing, creative and technology. Job Description Our Senior Android Developers are experienced engineers eager to stay on the bleeding-edge of the mobile market across a broad spectrum of industries. You thrive on bringing mobile projects to life with clients, from concept to implementation. Your guidance and input drives architecture and functionality decisions. Whether you prefer providing mentorship to junior engineers or acting as a technical sounding board for all, this role invites seasoned engineers to exercise their deep expertise. YOUR ROLE: Sr. Android Developer Partner closely with clients to define their mobility requirements and understand client success metrics Create and deliver mobile solutions that meet clients needs while maintaining a keen eye on world-class user experiences Work closely on a cross functional team with other roles such as Project Managers, Designers, QA, etc Lead mobile projects from concept to implementation, including weighing in on key architectural decisions Leverage experience developing software and managing teams of developers to execute on mobile development projects of various sizes Provide technical leadership and mentor junior team members OR act as a subject matter expert (SME) in a particular technology Participate in Agile/SCRUM SDLC Lead code and architecture reviews YOUR EXPERIENCE: Basic Qualifications 5+ years of experience in software development 3+ years in software development in a team environment 1+ years in Android Bachelor's degree in Computer Science or similar field SET YOURSELF APART: Preferred Skills Mastery of Android SDK Experience in RxJava, MVP, Bluetooth, Kotlin, Android NDK Proficient with Unit and integration tests Previous experience interfacing with clients in consulting environment Have worked in Agile environment (Scrum preferred) Demonstrated track record of growing/mentoring team members Knowledge of web services, specifically REST APIs Hands on experience developing production-ready Android apps 1+ years of experience as a lead developer or team lead of a small team We take great pride in our benefits: Medical, dental, vision plans Flexible spending accounts 401k plan with matching Pre-tax commuter program Generous paid time off 9 company observed holidays Annual bonus and raise Stock purchase program Great team events Employee assistance program Wellness benefits Principals only. Recruiters, please don't contact this job poster."},{"jobdescription":"Johnson & Johnson Health Technology is looking for a Lead iOS Software Engineer to join a fast-paced, innovative, and highly visible team building mobile and web applications. The position is located at our Health Tech office in the SoMa district of San Francisco. Johnson & Johnson, through its operating companies, is the world's most comprehensive and broadly-based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical device markets. We strive to provide scientifically sound, high quality products and services to help heal, cure disease, and improve the quality of life of patients and their loved ones. Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J&J is proud to be an equal opportunity employer. Key responsibilities include: Software design, architecture, requirements analysis, and software development. Collaborating with the core engineering and product management team to review product requirements and user stories, propose viable implementation options, and define specific software tasks. Researching new and evolving technologies and developing proofs-of-concept. Providing thought leadership on industry best practices in mobile design, development, and testing. Working in an agile development team to iteratively deliver product releases. Ensuring code quality through code reviews, thorough unit tests, and collaboration with QA. Building elegant, well-tested solutions to complex problems. Qualifications A Bachelor's or Masters degree in Computer Science or equivalent is required. A results and performance driven attitude with strong sense of accountability is required. Expertise in Swift and Objective-C is required. Experience with React Native is required. Extensive experience with databases and schema design is required. Experience leveraging a wide range of Apples iOS frameworks is required. Experience designing and building reusable frameworks is required. Experience evaluating and integrating 3rd party libraries is required. Experience working in an agile development team is required Experience working with RESTful APIs is required. Experience with git is required. Experience with Android is a plus. Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Primary Location United States-California-San Francisco- Organization Johnson & Johnson Services Inc. (6090) Job Function Development Requisition ID 8402181205"},{"jobdescription":"Job Description Responsibilities: Develop Android client code solutions that deliver on Product Strategy and adhere to established engineering best practices, design guidelines and principles. Partner with Software Engineers, UX/UI, Quality Engineers, and Product Owners/Analysts to deliver high performing quality customer experiences that are engaging, purposeful and powerful in their simplicity. Working to remain an active learner in all technologies related to Android development (Kotlin, Java, Android SDK, Android Studio, Gradle, 3rd party libraries, Google developments etc.). Someone who is always curious to learn. Will get to work with the latest AR and ML technologies and bring that to real life. Actively participate in all team scrum ceremonies and contributing to ensure that all team commitments are delivered on time and of the highest quality. Influence and contribute to group discussions and incorporate feedback/communication from broader team. Actively engage with developers outside of the local sprint team across various disciplines (Android, iOS, APIs, Web, etc.). Working with designers on refining our user experiences with an eye to Human Interface Guidelines and Material Design. Demonstrated investment in Android development knowledge growth through self-study, side projects and/or school/work experience. Ability to detect and abstract common patterns in code. Basic Qualifications: Bachelor's degree 5+ years of native Android development experience Experience in publishing app to Google Play store 1+ years of experience building native Android app using Kotlin Developed Android libraries which would be used by other Android apps Experience in unit, instrumentation and functional test 3+ years with RESTful APIs to connect Android applications to back-end services 1+ years of experience in Jenkins Preferred Qualifications: Call Notes: Team Info: Role Info: Top Skills: Nice to have: Soft Skills:"},{"jobdescription":""},{"jobdescription":"Android Developer Who we are: Galileo is one of the largest payments processors and program managers in North America. We are the only payments innovator that applies tech and engineering capabilities to empower FinTech and financial institutions to unleash their full creativity to achieve their most inspired goals. Galileo leads its industry with superior fraud detection, security, decision-making analytics and regulatory compliance functionality combined with customized, responsive and flexible programs to accelerate the success of all payments companies and solve tomorrow's payments challenges today. We hire passionate, creative people. We focus on education, health, outdoor living, and our company values. The result-highly energetic and dedicated co-workers, and a highly productive, engaging, and a comfortable work environment. What we are looking for: A successful candidate will have 3+ years of experience building high-quality Android apps. A strong understanding of the full life cycle of app development using Google's Developer Portal Published apps in the market Experience designing, developing, debugging and deploying software for server-side development using Java/ Kotlin as the primary language Familiarity with the use of additional sensors You understand the nuances of Android SDK, different versions of Android, and how to effectively write code for a multitude of Android devices Extensive knowledge of Android design principles and third-party libraries A solid foundation of modern Java data structures, algorithms, and software design and can consistently deliver testable, scalable, highly-readable code using OO best practices. Prior experience building RESTful API's focusing on integration with back-end services Experience with cloud messaging API's, offline storage, background processing, threading, and performance tuning, caching and performance optimization. Hands on experience with continuous integration Passionate about Android and are always up to date with the latest industry trends concerning OS, devices, applications, web technologies and new user interactions as they are released. What you'll be doing: Developing NEW Android apps for a highly visible national company. The ability to test your architectural skills by being heavily involved in the design for high traffic applications. The opportunity to collaborate with our internal teams to evaluate and create the latest innovations in the Android ecosystem. Brownie points if you have: iOS development experience also Experience publishing Android apps to the Play Store"},{"jobdescription":"Job Title: Location: Duration: Job Description: The Application Developer/Systems Analyst will support, maintain, and provide enhancements, as needed, to integrated systems, COTS applications, custom-developed ancillary applications, and a Customer Information System (CIS) in support of the Customer Service division of a municipal utility. Roles & Responsibilities: Work with department users and IT staff to define scope, boundaries and deliverables for utility applications development projects Analyze and interpret requirements; Define application data requirements; identify data sources; diagram data flow Develop enhancements and perform maintenance on existing applications, systems, and sub-systems Write and test program code to extend system functionality, incorporate new subsystems and make other application changes and updates Configure existing application, test and deploy new configuration to users Coordinate user acceptance testing and the resolution of problems identified Develop logic and validation criteria, design and develop custom reports, screens, scripts, utility programs, menus and directories, using standard software and development tools Link applications to Oracle and SQL Server and configure and use ODBC Connectivity for various data sources including AS400/DB2 Resolve routine to moderately-complex systems problems; Troubleshoot system or application issues, diagnose and report to vendor, review status and apply fixes Document issues and fixes, lead the test efforts to validate solution Serve as a central point of coordination with IT on significant application/hardware problems and change request issues that require assignment of resources Plan and coordinate deployment of new technologies within the department Develop and maintain user documentation; Support development of test plans including acceptance criterions and testing data sets; Provide user support and training, as needed Develop and use query tools to generate reports; Test data validity, integrity, redundancy May develop training materials, handouts, desktop procedures; May conduct user applications training classes and one-on-one training sessions. Required Qualification: Graduate from an accredited four-year college or university with major coursework in management information systems, computer science or a closely related field Required Experience: Minimum 5 years working experience in systems analysis and application development and support Experienced in implementing business requirements/rules through customization, configuration, and setup Required Skills: Microsoft Access, SQL Server 2012 or higher, .NET Technology (ASP.NET, C#, C++, and Visual Basic), Java Mobile programming language for Android or IOS SSRS 2012 Report Server and SSIS 2012 or higher are required. AS400/ Query 400, DB2 query experience preferred. Proficient understanding of SQL code for database platforms in Microsoft SQL Server 2012/2016/2017 Proactive self-learner, researching issues and problem solving independently Able to plan, organize and prioritize daily assignments and work activities. About our Company: - E-Talent Network is responsible for carrying out the recruitment process and is a service provider for 22nd Century Technologies. 22nd Century Technologies is a business enterprise that supports demanding staffing programs for Corporations and State and Local Government Agencies. Its journey began in 1997 by supporting large Federal contracts which nudged us in the direction of creating large candidate pools across the country. Over the last 20 years, we have built a strong business model that is carefully constructed to deliver on multiple facets. We have proven past performance of providing services that exceed our clients' expectations. Today 22nd Century technologies supports clients in all 50 states and has grown to be a company that is trusted and sought for providing a complex mix of workforce solutions. With a firm grip on the entire spectrum of staffing solutions, we have placed more than 500,000 skilled resources and delivered 15 million+ man-hours. “22nd Century Technologies is an Equal Opportunity Employer\" and “US Citizens & all other parties authorized to work in the US are encouraged to apply.\" E-Talent Network is proud to service TSCTI recruitment needs with Our Global Delivery model with 110 recruiters, data miners and research analysts working across multiple time zones is backed by an internal database of 2.4 million resources across all major industries."},{"jobdescription":"Hi,  Title Mobile App Test Automation  Position Fulltime  Location Milpitas, California  Salary- $Open(Best Possible)  Required Skills:   As a Lead, you are responsible for managing a small team of analysts, developers, testers or engineers and drive delivery of a small module within a project (Delivery/Maintenence/Testing)  You may serve as entry level specialist with expertise in particular technology/industry domain/a process / application / product.  You are responsible for functional/technical track of a project. Minimum work experience:5 - 8 Years   Note: If interested please send your updated resume and include your rate requirement along with your contact details with a suitable time when we can reach you. If you know of anyone in your sphere of contacts, who would be a perfect match for this job then, we would appreciate if you can forward this posting to them with a copy to us.  We look forward to hearing from you at the earliest!"},{"jobdescription":"Webex Teams iOS Engineer Location: Seattle, Washington, US Additional Location(s) Bellevue Area of Interest Engineer - Software Job Type Professional Technology Interest Collaboration, Video Job Id 1267220 What You'll Do The Cisco Collaboration Mobile Engineering team is seeking our next Rock Star Android Mobile Developer to join our dynamic team of Engineers in Seattle. In this role you will contribute to the design, development of new product features and product releases for our industry leading WebEx Teams Mobile applications. In addition, you partner with our Product Development teams to make enhancements to the UX/UI based on customer demands and to improve end user experience. Responsibilities You will develop world-class real-time video, audio and messaging mobile applications You will contribute to the development of new client releases Design, build and maintain large-scale, high-performance iOS applications Develop mobile applications using a combination of C++, Objective-C or Swift Help make product decisions driven by analytics Who You'll Work For The WebEx Operations Engineering team is part for the Cisco Cloud Collaboration organization, which is a $2 billion dollar business that is a global leader in providing Collaboration messaging, and conference micro-services and mobile applications that are changing the way people communicate and work from anywhere. Who Are You You are a Software Developer with proven experience in the development of multi-threaded software applications. You thrive in fast-paced Agile development environment and possess a passion for mobile app development. Minimum qualifications Bachelor degree in Computer Science, related technical field, or equivalent practical experience 5-7 years of multi-threaded application software development and/or iOS mobile app development using C++, Objective-C or Swift Experience with one or more general purpose programming languages including but not limited to: Swift, Java, C/C++, C#, Python, JavaScript Knowledge of UI frameworks Preferred qualifications Experience in developing or integrating cloud platform Technical knowledge of iOS mobile application development Passionate about delivering world class user experience to end user Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records. Why Cisco At Cisco, each person brings their unique talents to work as a team and make a difference. Yes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people. We connect everything  people, process, data and things  and we use those connections to change our world for the better. We innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more  from Smart Cities to your everyday devices. We benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities. Colorful hair? Dont care. Tattoos? Show off your ink. Like polka dots? Thats cool. Pop culture geek? Many of us are. Be you, with us! #WeAreCisco Cisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis."},{"jobdescription":"Immediate need for a talented . Net Developer with experience in the Airline Industry . This is a 12 Months contract opportunity with long-term potential and is located in Mclean , VA Please review the job description below.  Job ID: 19-43759  JOB SUMMARY   ? Bachelor's degree in relevant area, e.g., Computer Science, IT, Web Applications, or related field, from an accredited college or university required; master's degree or completion of post-graduate courses in related field preferred; or, the equivalent combination of education and practical experience. ? Five (5) years of related experience required, more strongly preferred. Additional applicable experience may be substituted for the academic requirement. ? Web design, mobile applications development, Responsive Web Design (RWD), and database management required. ? Expertise with Visual Studio .Net; ASP.Net; C#; Java; SQL Server; and, Adobe Photoshop and Illustrator required. ? Knowledge of the Microsoft .Net Framework and Client/server-side architecture required. ? Experience with .NET-based CMS systems strongly preferred. ? Expertise with Web/Mobile-based security and familiarity with authentication environments, particularly ADFS and IdentityServer, strongly preferred. ? Experience with design, requirements gathering, and working with systems analysts strongly preferred. ? Advanced knowledge/skills in HTML5; CSS3; JavaScript; VB.NET; ASP.NET; Xamarin; Web Forms/MVC/Web API; SQL; and, MongoDB strongly preferred. ? Advanced knowledge/skills troubleshooting/debugging .NET code; UI/frontend design; Windows IIS server setup; and, Web services strongly preferred. ? Excellent interpersonal and communication skills, oral and written, for effective interaction with all levels of contacts, internal and external. ? Must be a self-starter with professional maturity and sound judgment, capable of independent decision-making. ? Must possess exceptional time management skills; be able to work in a fast-paced, multi-tasking environment; and, transition easily between projects. ? Software: Microsoft Word and Outlook required.     Our client is a leading Airline  Industry and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration."},{"jobdescription":"We will accept corp to corp or w2 contractors. For our w2 consultants, we offer a great benefits package that includes Medical, Dental, and Vision benefits, 401k with company matching, and life insurance. Requirements of the Senior iOS Developer: At least 5 years of experience in mobile app development Advanced proficiency in Objective-C and Swift Experience integrating RESTful services Experience in end to end app development through release Clear and effective communication and interpersonal skills About Eliassen Group:"},{"jobdescription":"A Series A NYC based startup, who have developed an online platform that enables its users to design digital picture frames utilizing AI are looking for a Senior Backend Engineer, working with Ruby on Rails.  The Company are post Series A ($15m in funding) and have experienced over 300% year on year growth.  The product applies state-of-the-art computer vision and machine learning technology to thousands of photos every day to automatically sort and curate users' libraries.  Role and Responsibilities  Develop the backend system, which powers a network of thousands of picture frames Utilize machine learning and computer vision techniques applied to the photo database Identify and prioritize problems and opportunities in the tech stack Work across mobile and web application Build features in the internal API's  Skills and Experience  3+ year’s Back End Engineering experience (2+ years Ruby at scale) Experience with ActiveRecord and ActionController Experience with AWS, including EC2, S3 Experience with Python too would be ideal Machine Learning frameworks i.e. Caffe - not essential  Salary - D.O.E plus equity and bonus and unlimited PTO"},{"jobdescription":"Position Title: Application Developer Location: Salem,OR Duration :06 Months  Description: The IE Project has an urgent need for a mainframe developer in Salem Oregon. IE Project: The Integrated Eligibility (IE) Project and associated subprojects (Legacy, Disaster Recovery, Data Conversion) are large bodies of work and are collectively Oregon’s largest active IT project. These projects utilize staff from multiple agencies, as well as multiple contractors. Further, there are overlapping priorities from other DHS and Oregon Health Authority (OHA) projects, and ongoing maintenance and operations work. IE is an expansion of Oregon's Affordable Care Act Compliant Modified Adjusted Gross Income (MAGI) Medicaid eligibility determination system, called OregONEligibility (or ONE) for the Oregon Health Authority (OHA). The IE Project goal is to have a single system where an Oregonian can express information about themselves and members of their household and be determined eligible for multiple health and human service programs — both DHS and OHA programs. At the end of the IE Project, Oregonians should be able to apply online for benefits seven days a week and caseworkers should be able to focus on the care coordination activities for clients rather than on data entry across multiple systems.  REQUIRED Minimum of six years of experience as a Senior Mainframe Developer using COBOL, CICS, JCL, DB2, JCL, TSO/ISPF. Other desirable experience is as follows: Demonstrated knowledge of relevant functional business areas of Oregon Self-Sufficiency Program (SSP) and Oregon Aging and People with Disabilities (APD) programs and processes, or similar knowledge from other states. Previous experience in state or local Oregon government agencies or for Human Services organizations in other states. Demonstrated experience with large-scale complex technical architectures that include interfaces with other large-scale systems. Demonstrated knowledge with logging of communication between large-scale systems. Demonstrated knowledge in the handshake between interfacing systems to ensure proper reception and synchronization of records; this should specifically include experience developing and testing web services across multiple platforms. Demonstrated experience working independently with minimal supervision and direction Demonstrated experience developing analysis and design documentation necessary for the construction, testing and implementation of identified tasks to be completed. Thanks& Regards  Sameer Ali Senior Technical Recruiter COOLSOFT ( E-Verified Employer ) 3240 Office Pointe Place, Suite 200, Louisville, KY, 40220 Contact:  502-327-9805 - Ext: 5011 Mobile:315-327-2395 Email:  sam@coolsofttech.com  Hangout: mohammedsameer140@gmail.com URL: www.coolsofttech.com"},{"jobdescription":"Net2Source is a Global Workforce Solutions Company headquartered at NJ, USA with its branch offices in Asia Pacific Region. We are one of the fastest growing IT Consulting company across the USA and we are hiring \" Mobile Engineer \" for one of our clients. We offer a wide gamut of consulting solutions customized to our 450+ clients ranging from Fortune 500/1000 to Start-ups across various verticals like Technology, Financial Services, Healthcare, Life Sciences, Oil & Gas, Energy, Retail, Telecom, Utilities, Technology, Manufacturing, the Internet, and Engineering. Title: Mobile Engineer Location: Denver, CO Term: Full Time/ Contract JOB Description: Mandatory Skills: Experience on Mobile Apps design for iOS and Android Experience on Roku services Design architecture video components like DAC , EC , and interactions with other cable systems like VOD , Micro services Knowledge in AWS and micro services Must understand cable MSO systems Good communication. Have ability to understand complex cable systems. Design and document systems HLD , LLD etc. Role will be environment planning with video background on charter , twc or BHN ecosystems,  Preferred Skills: Knowledge in AWS is preferable  Job Roles/Responsibilities: Other duties will include status reporting, coordinating with the offshore team and day to day interaction with the client regarding the project progress. Actively and consistently support all efforts to simplify and enhance the customer experience Contribute to the Company vision of being the industry leader in customer service through quality, commitment, courtesy and teamwork. Be able to prioritize daily activity based on the needs of the business.  About Net2Source, Inc. Net2Source is an employer-of-choice for over 2200+ consultants across the globe. We recruit top-notch talent for over 40 Fortune and Government clients coast-to-coast across the U.S. We are one of the fastest-growing companies in the U.S. and this may be your opportunity to join us! Want to read more about Net2Source?, Visit us at www.net2source.com Equal Employment Opportunity Commission The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. Net2Source Inc. is one of the fastest growing Global Workforce Solutions company with a growth of 100% YoY for last consecutive 3 years with over 2200+ employees globally and 30 locations in US and operations in 20 countries. With an experience of over a decade we offer unmatched workforce solutions to our clients by developing an in-depth understanding of their business needs. We specialize in Contingent hiring, Direct Hires, Statement of Work, Payroll Management, IC Compliance, VMS, RPO and Managed IT Services. Fast Facts about Net2Source: Inception in 2007, privately held, Debt free 2200+ employees globally 375+ In- house Team of Sales, Account Management and Recruitment with coast to coast COE. 30 offices in US and 50+ Offices globally Operations in 20 countries (US, Canada, Mexico, APAC, UK, UAE, Europe, , Europe, Latin America, Japan, Australia) Awards and Accolades: 2018 Fastest Growing IT Staffing Firm in North America by Staffing Industry Analysts 2018 Fastest-Growing Private Companies in America as a 5 times consecutive honoree Inc. 5000 2018 Fastest 50 by NJBiz 2018 Techserve Excellence Award (IT and Engineering Staffing) 2018 Best of the Best Platinum Award by Agile1 2018 40 Under 40 Award Winner by Staffing Industry Analysts 2018 CEO World Gold Award by SVUS 2017 Best of the Best Gold Award by Agile1"}]